# CannotCopyMultipleSketchParents Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyMultipleSketchParents Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Copying elements from unrelated Workplanes together is not supported in families. Try copying elements separately.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyMultipleSketchParents { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyMultipleSketchParents As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyMultipleSketchParents {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace